{
  "Semester 3": {
    "Digital Electronics": {
      "What is a flip-flop?": "A flip-flop is a bistable multivibrator that stores one bit of binary data.",
      "Difference between SR and JK flip-flop?": "SR has invalid states when both inputs are 1; JK resolves this with toggling action.",
      "What is a multiplexer?": "A multiplexer selects one input from multiple data inputs and forwards it to a single output line.",
      "What is the use of K-map?": "Karnaugh Map (K-map) is used for simplifying Boolean expressions."
    },
    "Network Theory": {
      "State Ohm's law": "Ohm's law states that V = I × R, where V is voltage, I is current, and R is resistance.",
      "What is Thevenin’s theorem?": "It allows simplification of a network to a single voltage source and resistance.",
      "What is a mesh analysis?": "Mesh analysis is a method used to solve circuits using loop currents.",
      "Define node voltage": "Node voltage is the electric potential difference between a node and the ground."
    }
  },
  "Semester 4": {
    "Microcontrollers": {
      "What is 8051 microcontroller?": "8051 is an 8-bit microcontroller with inbuilt RAM, ROM, timers, counters, and serial communication.",
      "What is the use of stack pointer in 8051?": "The stack pointer stores the address of the last stored value in the stack.",
      "What is the default oscillator frequency of 8051?": "It is typically 12 MHz.",
      "Difference between microcontroller and microprocessor?": "Microcontroller has memory and I/O ports on the chip, microprocessor does not."
    },
    "Signals and Systems": {
      "What is a signal?": "A signal is a function that conveys information about a phenomenon.",
      "Difference between energy and power signal?": "Energy signals have finite energy; power signals have finite power but infinite energy.",
      "What is convolution?": "Convolution is a mathematical operation on two signals producing a third signal.",
      "What is the Laplace transform used for?": "It is used to analyze linear time-invariant systems."
    }
  },
  "Semester 5": {
  "Digital Signal Processing": {
    "What is aliasing in DSP?": "Aliasing is the effect that causes different signals to become indistinguishable when sampled. It can be avoided by using anti-aliasing filters.",
    "State the Nyquist theorem.": "The Nyquist theorem states that the sampling rate must be at least twice the maximum frequency present in the signal.",
    "What is the Z-transform?": "The Z-transform converts discrete-time signals from time domain to frequency domain, similar to Laplace Transform for continuous-time signals.",
    "What is the use of FFT in DSP?": "FFT (Fast Fourier Transform) is an efficient algorithm to compute the Discrete Fourier Transform (DFT) and is used for spectral analysis.",
    "Define convolution.": "Convolution is a mathematical operation used to combine two signals to form a third signal, representing how the shape of one is modified by the other."
  },
  "Control Systems": {
    "Define transfer function.": "A transfer function is the Laplace transform of the system's impulse response, representing the system's output-to-input ratio in the frequency domain.",
    "What is a feedback system?": "A feedback system compares the output with the desired input and adjusts accordingly to reduce the error.",
    "Define time constant.": "Time constant is the time required for a system's response to reach 63.2% of its final value in a first-order system.",
    "What is steady-state error?": "Steady-state error is the difference between the desired final output and the actual output of a system as time approaches infinity.",
    "What is root locus?": "Root locus is a graphical method used to study how the roots of a system change with variation in system gain."
  }
}

}
