{
  "Semester 3": {
    "Digital Electronics": {
      "What is a flip-flop?": "A flip-flop is a bistable multivibrator that stores one bit of binary data.",
      "Difference between SR and JK flip-flop?": "SR has invalid states when both inputs are 1; JK resolves this with toggling action.",
      "What is a multiplexer?": "A multiplexer selects one input from multiple data inputs and forwards it to a single output line.",
      "What is the use of K-map?": "Karnaugh Map (K-map) is used for simplifying Boolean expressions.",
      "Explain the working of JK flip-flop.": "The JK flip-flop is a universal flip-flop with J and K inputs. When both inputs are HIGH, it toggles its state. It eliminates the undefined state present in the SR flip-flop.",
      "What is a multiplexer?": "A multiplexer (MUX) is a combinational circuit that selects one of many input signals and forwards the selected input into a single line.",
      "Difference between combinational and sequential circuits.": "Combinational circuits do not have memory and their output depends only on the current input. Sequential circuits have memory and output depends on both current input and past history.",
      "What is the use of K-map in digital logic?": "Karnaugh Map (K-map) is used to simplify Boolean expressions by visually minimizing logic functions using grouping.",
      "Explain the race-around condition in flip-flops.": "Race-around occurs in JK flip-flops when both inputs are high and the clock pulse is long. The output toggles continuously within the clock pulse, causing instability.",
      "State DeMorgan's Theorems.": "1. (A·B)’ = A’ + B’  and  2. (A + B)’ = A’ · B’. These theorems are used to simplify logic expressions and design using NAND/NOR gates.",
      "Differentiate between asynchronous and synchronous counters.": "In asynchronous counters, flip-flops are triggered at different times, while in synchronous counters, all flip-flops are triggered simultaneously using the same clock.",
      "What is a decoder?": "A decoder is a combinational logic circuit that converts binary information from n input lines to a maximum of 2^n unique output lines.",
      "Explain half adder and full adder.": "A half adder adds two single-bit binary numbers and gives sum and carry. A full adder adds three bits (including carry-in) and gives sum and carry-out.",
      "What are universal gates?": "NAND and NOR gates are called universal gates because they can be used to construct any other basic logic gate.",
      "Explain the concept of propagation delay.": "Propagation delay is the time taken for an input signal change to result in an output signal change. It affects the speed of digital circuits.",
      "What is a shift register?": "A shift register is a sequential circuit that stores and shifts data bits one by one either left or right depending on control input.",
      "What is a parity bit?": "A parity bit is an error detection technique in which a single bit is added to data to make the number of 1s either even (even parity) or odd (odd parity).",
      "What is fan-in and fan-out?": "Fan-in is the number of inputs a gate can handle. Fan-out is the number of inputs that a single output can drive.",
      "What is setup time and hold time?": "Setup time is the minimum time before the clock edge that the input must be stable. Hold time is the minimum time after the clock edge the input must remain stable.",
      "What is a decoder?": "A decoder is a combinational logic circuit that converts binary information from n input lines to a maximum of 2^n unique output lines.",
"Explain half adder and full adder.": "A half adder adds two single-bit binary numbers and gives sum and carry. A full adder adds three bits (including carry-in) and gives sum and carry-out.",
"What are universal gates?": "NAND and NOR gates are called universal gates because they can be used to construct any other basic logic gate.",
"Explain the concept of propagation delay.": "Propagation delay is the time taken for an input signal change to result in an output signal change. It affects the speed of digital circuits.",
"What is a shift register?": "A shift register is a sequential circuit that stores and shifts data bits one by one either left or right depending on control input.",
"What is a parity bit?": "A parity bit is an error detection technique in which a single bit is added to data to make the number of 1s either even (even parity) or odd (odd parity).",
"What is fan-in and fan-out?": "Fan-in is the number of inputs a gate can handle. Fan-out is the number of inputs that a single output can drive.",
"What is setup time and hold time?": "Setup time is the minimum time before the clock edge that the input must be stable. Hold time is the minimum time after the clock edge the input must remain stable."

    },
    "Network Theory": {
      "State Ohm's law": "Ohm's law states that V = I × R, where V is voltage, I is current, and R is resistance.",
      "What is Thevenin’s theorem?": "It allows simplification of a network to a single voltage source and resistance.",
      "What is a mesh analysis?": "Mesh analysis is a method used to solve circuits using loop currents.",
      "Define node voltage": "Node voltage is the electric potential difference between a node and the ground.",
      "What is Ohm’s law?": "Ohm’s law states that the current through a conductor between two points is directly proportional to the voltage across the two points, i.e., V = IR.",
"State Kirchhoff’s Current Law (KCL).": "KCL states that the total current entering a junction is equal to the total current leaving the junction.",
"State Kirchhoff’s Voltage Law (KVL).": "KVL states that the sum of all voltages around any closed loop in a circuit is zero.",
"Define node, branch, and loop.": "A node is a point where two or more elements connect. A branch is a single element like a resistor. A loop is a closed path in a circuit.",
"Difference between active and passive elements.": "Active elements can supply energy (like voltage sources), while passive elements consume or store energy (like resistors, capacitors).",
"Define impedance and admittance.": "Impedance is the opposition offered by a circuit to AC, denoted by Z. Admittance is the reciprocal of impedance, denoted by Y.",
"What is resonance in RLC circuits?": "Resonance occurs when the inductive reactance equals the capacitive reactance, resulting in maximum current in the circuit.",
"Define quality factor (Q-factor).": "The Q-factor is the ratio of reactive power to real power. It indicates the sharpness of resonance in an RLC circuit.",
"Difference between series and parallel circuits.": "In series circuits, components are connected end-to-end; in parallel circuits, components are connected across common points.",
"What is the significance of Thevenin’s theorem?": "Thevenin’s theorem simplifies a complex linear circuit to a single voltage source and a series resistance when viewed from two terminals.",
"Explain Norton’s theorem.": "Norton’s theorem states that any linear electrical network with voltage and current sources can be replaced with an equivalent current source in parallel with a resistance.",
"What is superposition theorem?": "The superposition theorem states that the voltage or current in any element of a linear circuit is the algebraic sum of the voltages or currents caused by each independent source acting alone.",
"What is maximum power transfer theorem?": "This theorem states that maximum power is transferred from a source to a load when the load resistance equals the source resistance.",
"Explain time constant of an RC circuit.": "Time constant (τ) is the time required for the voltage to rise to 63.2% of its final value. τ = RC for an RC circuit.",
"What are dependent and independent sources?": "Independent sources supply a fixed voltage or current. Dependent sources change their value depending on some other voltage or current in the circuit."

    }
  },
  "Semester 4": {
    "Microcontrollers": {
      "What is 8051 microcontroller?": "8051 is an 8-bit microcontroller with inbuilt RAM, ROM, timers, counters, and serial communication.",
      "What is the use of stack pointer in 8051?": "The stack pointer stores the address of the last stored value in the stack.",
      "What is the default oscillator frequency of 8051?": "It is typically 12 MHz.",
      "Difference between microcontroller and microprocessor?": "Microcontroller has memory and I/O ports on the chip, microprocessor does not."
    },
    "Signals and Systems": {
      "What is a signal?": "A signal is a function that conveys information about a phenomenon.",
      "Difference between energy and power signal?": "Energy signals have finite energy; power signals have finite power but infinite energy.",
      "What is convolution?": "Convolution is a mathematical operation on two signals producing a third signal.",
      "What is the Laplace transform used for?": "It is used to analyze linear time-invariant systems."
    }
  },
  "Semester 5": {
  "Digital Signal Processing": {
    "What is aliasing in DSP?": "Aliasing is the effect that causes different signals to become indistinguishable when sampled. It can be avoided by using anti-aliasing filters.",
    "State the Nyquist theorem.": "The Nyquist theorem states that the sampling rate must be at least twice the maximum frequency present in the signal.",
    "What is the Z-transform?": "The Z-transform converts discrete-time signals from time domain to frequency domain, similar to Laplace Transform for continuous-time signals.",
    "What is the use of FFT in DSP?": "FFT (Fast Fourier Transform) is an efficient algorithm to compute the Discrete Fourier Transform (DFT) and is used for spectral analysis.",
    "Define convolution.": "Convolution is a mathematical operation used to combine two signals to form a third signal, representing how the shape of one is modified by the other."
  },
  "Control Systems": {
    "Define transfer function.": "A transfer function is the Laplace transform of the system's impulse response, representing the system's output-to-input ratio in the frequency domain.",
    "What is a feedback system?": "A feedback system compares the output with the desired input and adjusts accordingly to reduce the error.",
    "Define time constant.": "Time constant is the time required for a system's response to reach 63.2% of its final value in a first-order system.",
    "What is steady-state error?": "Steady-state error is the difference between the desired final output and the actual output of a system as time approaches infinity.",
    "What is root locus?": "Root locus is a graphical method used to study how the roots of a system change with variation in system gain."
  }
}

}
